sriza-n/flight-computer/esp32_rocket.cpp
    preferences.putFloat("loraFreq", loraFreq);
    preferences.putLong("loraBW", loraBandwidth);
    preferences.putUChar("loraCR", loraCodingRate);
    preferences.putUChar("loraSF", loraSpreadingFactor);
    preferences.end();
}

void handleRoot()
{
    String html = "<!DOCTYPE html>"
                  "<html>"
                  "<head>"
                  "<title>Rocket Engine Configuration</title>"
                  "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">"
                  "<style>"
                  "body{font-family:Arial,sans-serif;margin:40px;background:#f0f0f0;}"
                  ".container{max-width:500px;margin:0 auto;background:white;padding:30px;border-radius:10px;box-shadow:0 4px 6px rgba(0,0,0,0.1);}"
                  "h1{color:#333;text-align:center;margin-bottom:30px;}"
                  "h2{color:#555;border-bottom:2px solid #4CAF50;padding-bottom:10px;}"
                  "input[type=\"number\"],select{width:100%;padding:12px;margin:8px 0;border:1px solid #ddd;border-radius:4px;box-sizing:border-box;}"
                  "input[type=\"submit\"]{width:100%;background-color:#4CAF50;color:white;padding:14px;margin:8px 0;border:none;border-radius:4px;cursor:pointer;font-size:16px;}"
                  "input[type=\"submit\"]:hover{background-color:#45a049;}"
                  ".section{margin-bottom:30px;padding:20px;background:#f9f9f9;border-radius:8px;}"
                  ".warning{background:#fff3cd;border:1px solid #ffeaa7;padding:15px;border-radius:4px;color:#856404;margin:10px 0;}"
                  "label{display:block;margin:15px 0 5px 0;font-weight:bold;color:#333;}"
                  "small{color:#666;display:block;margin-top:5px;font-size:12px;}"
                  ".footer{text-align:center;margin-top:30px;padding:15px;color:#666;font-size:14px;border-top:1px solid #ddd;}"
                  "</style>"
                  "</head>"
                  "<body>"
                  "<div class=\"container\">"
                  "<h1>🚀 Rocket Engine Configuration 🚀</h1>";

    html += "<form action=\"/save\" method=\"POST\">";

    // Engine Configuration Section
    html += "<div class=\"section\">"
            "<h2>Engine Configuration</h2>"
            "<label for=\"ignDelay\">Valve Open Delay (ms):</label>"
            "<input type=\"number\" id=\"ignDelay\" name=\"ignDelay\" value=\"" +
            String(ignitionOnDelay) + "\" min=\"500\" max=\"10000\">"
                                      "<small>Time delay before valves open after ignition (500-10000ms)</small>"

                                      "<label for=\"waitDelay\">Valve Open Duration (ms):</label>"
                                      "<input type=\"number\" id=\"waitDelay\" name=\"waitDelay\" value=\"" +
            String(ignitionWaitingDelay) + "\" min=\"1000\" max=\"90000\">"
                                           "<small>How long valves stay open during ignition (1000-90000ms)</small>"

                                           "<label for=\"parsuitedeploy\">Parachute Deploy Altitude Change (m):</label>"
                                           "<input type=\"number\" id=\"parsuitedeploy\" name=\"parsuitedeploy\" value=\"" +
            String(parsuitedeploy) + "\" min=\"0\" max=\"100\">"
                                     "<small>Altitude change threshold for parachute deployment (0-100m)</small>"
                                     "</div>";

    // LoRa Configuration Section
    html += "<div class=\"section\">"
            "<h2>LoRa Configuration</h2>"
            "<div class=\"warning\">&#9888;&#65039; Changing LoRa settings requires restart. Ensure transmitter uses same settings!</div>"

            "<label for=\"lora_freq\">Frequency (MHz):</label>"
            "<input type=\"number\" id=\"lora_freq\" name=\"lora_freq\" min=\"410\" max=\"525\" step=\"0.1\" value=\"" +
            String(loraFreq) + "\">"
                               "<small>Valid range: 410-525 MHz</small>"

                               "<label for=\"lora_bw\">Signal Bandwidth (Hz):</label>"
                               "<select id=\"lora_bw\" name=\"lora_bw\">"
                               "<option value=\"7800\"" +
            String(loraBandwidth == 7800 ? " selected" : "") + ">7.8 kHz (Max Range)</option>"
                                                               "<option value=\"10400\"" +
            String(loraBandwidth == 10400 ? " selected" : "") + ">10.4 kHz</option>"
                                                                "<option value=\"15600\"" +
            String(loraBandwidth == 15600 ? " selected" : "") + ">15.6 kHz</option>"
                                                                "<option value=\"20800\"" +
            String(loraBandwidth == 20800 ? " selected" : "") + ">20.8 kHz</option>"
                                                                "<option value=\"31250\"" +
            String(loraBandwidth == 31250 ? " selected" : "") + ">31.25 kHz</option>"
                                                                "<option value=\"41700\"" +
            String(loraBandwidth == 41700 ? " selected" : "") + ">41.7 kHz</option>"
                                                                "<option value=\"62500\"" +
            String(loraBandwidth == 62500 ? " selected" : "") + ">62.5 kHz</option>"
                                                                "<option value=\"125000\"" +
            String(loraBandwidth == 125000 ? " selected" : "") + ">125 kHz (Balanced)</option>"
                                                                 "<option value=\"250000\"" +
            String(loraBandwidth == 250000 ? " selected" : "") + ">250 kHz</option>"
                                                                 "<option value=\"500000\"" +
            String(loraBandwidth == 500000 ? " selected" : "") + ">500 kHz (Max Speed)</option>"
                                                                 "</select>"

