sriza-n/flight-computer/esp32_rocket.cpp
                                                                 "<label for=\"lora_cr\">Coding Rate (4/x):</label>"
                                                                 "<select id=\"lora_cr\" name=\"lora_cr\">"
                                                                 "<option value=\"5\"" +
            String(loraCodingRate == 5 ? " selected" : "") + ">4/5 (Fast)</option>"
                                                             "<option value=\"6\"" +
            String(loraCodingRate == 6 ? " selected" : "") + ">4/6</option>"
                                                             "<option value=\"7\"" +
            String(loraCodingRate == 7 ? " selected" : "") + ">4/7</option>"
                                                             "<option value=\"8\"" +
            String(loraCodingRate == 8 ? " selected" : "") + ">4/8 (Robust)</option>"
                                                             "</select>"

                                                             "<label for=\"lora_sf\">Spreading Factor:</label>"
                                                             "<select id=\"lora_sf\" name=\"lora_sf\">"
                                                             "<option value=\"6\"" +
            String(loraSpreadingFactor == 6 ? " selected" : "") + ">SF6 (Max Speed)</option>"
                                                                  "<option value=\"7\"" +
            String(loraSpreadingFactor == 7 ? " selected" : "") + ">SF7 (Fast)</option>"
                                                                  "<option value=\"8\"" +
            String(loraSpreadingFactor == 8 ? " selected" : "") + ">SF8</option>"
                                                                  "<option value=\"9\"" +
            String(loraSpreadingFactor == 9 ? " selected" : "") + ">SF9 (Balanced)</option>"
                                                                  "<option value=\"10\"" +
            String(loraSpreadingFactor == 10 ? " selected" : "") + ">SF10</option>"
                                                                   "<option value=\"11\"" +
            String(loraSpreadingFactor == 11 ? " selected" : "") + ">SF11</option>"
                                                                   "<option value=\"12\"" +
            String(loraSpreadingFactor == 12 ? " selected" : "") + ">SF12 (Max Range)</option>"
                                                                   "</select>"
                                                                   "</div>";

    html += "<input type=\"submit\" value=\"Save Configuration\">";
    html += "</form>";

    html += "<div class=\"footer\">"
            "By Srijan Koju"
            "</div>";

    html += "</div>"
            "</body>"
            "</html>";

    server.send(200, "text/html", html);
}

void handleSave()
{
    if (server.hasArg("ignDelay") && server.hasArg("waitDelay"))
    {
        // Engine parameters
        ignitionOnDelay = server.arg("ignDelay").toInt();
        ignitionWaitingDelay = server.arg("waitDelay").toInt();
        parsuitedeploy = server.arg("parsuitedeploy").toInt();

        // Apply limits for engine parameters
        ignitionOnDelay = constrain(ignitionOnDelay, 500, 10000);
        ignitionWaitingDelay = constrain(ignitionWaitingDelay, 1000, 90000);
        parsuitedeploy = constrain(parsuitedeploy, 0, 100);

        // LoRa parameters
        if (server.hasArg("lora_freq"))
        {
            loraFreq = server.arg("lora_freq").toFloat();
            loraFreq = constrain(loraFreq, 410.0, 525.0);
        }
        if (server.hasArg("lora_bw"))
        {
            loraBandwidth = server.arg("lora_bw").toInt();
        }
        if (server.hasArg("lora_cr"))
        {
            loraCodingRate = server.arg("lora_cr").toInt();
            loraCodingRate = constrain(loraCodingRate, 5, 8);
        }
        if (server.hasArg("lora_sf"))
        {
            loraSpreadingFactor = server.arg("lora_sf").toInt();
            loraSpreadingFactor = constrain(loraSpreadingFactor, 6, 12);
        }

        savePreferences();

        server.sendHeader("Location", "/");
        server.send(303);
    }
    else
    {
        server.send(400, "text/plain", "Missing parameters");
    }
}

void setup()
{
    Serial.begin(115200);

    // Load saved preferences
    loadPreferences();

    if (!radio.begin())
    {
        Serial.println("Radio hardware not responding");
        // while (1)
        //   ; // Stop if the module isn't responding
    }
    if (!radio.isChipConnected())
    {
        Serial.println("nRF24L01 module not connected properly.");
        // while (1)
        //   ; // Stop if the module isn't connected
    }
    // Enhanced radio configuration
    radio.setPALevel(RF24_PA_MAX);
    // radio.setDataRate(RF24_2MBPS);
    radio.setDataRate(RF24_250KBPS);
    radio.setChannel(108);

    // Enable auto-ack
    radio.enableAckPayload();
    radio.setAutoAck(true);

    // Enable dynamic payloads
    // radio.enableDynamicPayloads();

    radio.openWritingPipe(addresses[1]);
    radio.openReadingPipe(1, addresses[0]);
    radio.startListening();

    pinMode(IGNITION_PIN, OUTPUT);
    pinMode(BUZZER_PIN, OUTPUT);
    pinMode(TEENSY_POWER_PIN, OUTPUT);

    digitalWrite(IGNITION_PIN, LOW);
    digitalWrite(BUZZER_PIN, LOW);
    digitalWrite(TEENSY_POWER_PIN, LOW);

    valve1.begin();
    valve2.begin();

    Wire.begin();
    Wire.setClock(400000); // 100kHz instead of default 400kHz

    // Create ValveI2CTask
    xTaskCreate(
        ValveI2CTask,       // Task function
        "ValveI2CTask",     // Task name
        2048,               // Stack size (bytes)
        NULL,               // Parameters
        2,                  // Priority
        &ValveI2CTaskHandle // Task handle
    );

    // Create RadioCmdTask
    xTaskCreate(
        RadioCmdTask,       // Task function
        "RadioCmdTask",     // Task name
        2048,               // Stack size (bytes)
        NULL,               // Parameters
        1,                  // Priority
        &RadioCmdTaskHandle // Task handle
    );

    // Create WiFiServerTask
    xTaskCreate(
        WiFiServerTask,       // Task function
        "WiFiServerTask",     // Task name
        4096,                 // Stack size (bytes)
        NULL,                 // Parameters
        3,                    // Priority
        &WiFiServerTaskHandle // Task handle
    );

    Serial.println("FreeRTOS tasks created successfully");
}

void loop()
{
    // Empty - FreeRTOS scheduler handles tasks
    vTaskDelay(portMAX_DELAY);
}

void RadioCmdTask(void *pvParameters)
{
    const TickType_t xDelay = pdMS_TO_TICKS(25); // 50ms delay
    unsigned long lastRadioAvailableTime = 0;

    for (;;)
    {
        // Check if data is available on the radio
        if (radio.available())
        {
            uint8_t buffer[32]; // Use payloadSize constant
            uint8_t len = radio.getDynamicPayloadSize();

            // Ensure we don't exceed buffer size
            if (len > sizeof(buffer))
            {
                len = sizeof(buffer);
            }

            radio.read(&buffer, len);

            // Process command data
            if (len >= 5) // Minimum expected packet size (1 byte flags + 4 bytes servo angles)
            {
                int index = 0;

                // Extract digital pin states from first byte
                uint8_t digitalFlags = buffer[index++];

                // Update global state variables based on received flags
                readyState = (digitalFlags & 0x01) != 0;    // Bit 0
                ignitionState = (digitalFlags & 0x02) != 0; // Bit 1
                Servo1State = (digitalFlags & 0x04) != 0;   // Bit 2
                Servo2State = (digitalFlags & 0x08) != 0;   // Bit 3
                haltState = (digitalFlags & 0x10) != 0;     // Bit 4
                TestMode = (digitalFlags & 0x20) != 0;      // Bit 5
                ConfigMode = (digitalFlags & 0x40) != 0;    // Bit 6

                // Extract servo angles (2 bytes each)
                // int16_t servo1Angle, servo2Angle;
                memcpy(&servo1Angle, &buffer[index], 2);
                index += 2;
                memcpy(&servo2Angle, &buffer[index], 2);
                index += 2;
            }

            // Serial.print(readyState);
            // Serial.print(",");
            // Serial.print(ignitionState);
            // Serial.print(",");
            // Serial.print(Servo1State);
            // Serial.print(",");
            // Serial.print(Servo2State);
            // Serial.print(",");
            // Serial.print(haltState);
            // Serial.print(",");
            // Serial.print(servo1Angle);
            // Serial.print(",");
            // Serial.println(servo2Angle);

            lastRadioAvailableTime = millis();
        }

        // Set masterStateHigh true if radio.available() in last 500ms, else false
        if (millis() - lastRadioAvailableTime <= 500)
        {
            masterStateHigh = true;
        }
        else
        {
            masterStateHigh = false;
        }

        if (masterStateHigh)
        {
            digitalWrite(TEENSY_POWER_PIN, HIGH);
            teensyPowerState = true;

            // HOLDING SWITCH LOGIC: Act while switch is held HIGH
            if (readyState == HIGH)
            {
                if (!outputState1)
                {
                    outputState1 = true;
                    Buzz(2, 500, 500);
                }
            }
            else
            {
                if (outputState1)
                {
                    outputState1 = false;
                }
            }

