sriza-n/flight-computer/esp32_rocket.cpp
            if (ignitionState == HIGH && ignitionStateMachine == IgnitionState::IDLE)
            {
                if (!outputState2)
                {
                    outputState2 = true;
                    Buzz(3, 500, 500);
                    digitalWrite(IGNITION_PIN, HIGH);
                    ignitionStateMachine = IgnitionState::IGNITION_ON;
                    ignitionStartTime = millis();
                }
            }
        }
        else
        {
            // ...existing power-down logic...
            if (ignitionStateMachine == IgnitionState::IDLE)
            {
                outputState1 = false;
                digitalWrite(IGNITION_PIN, LOW);
                if (!outputState2)
                {
                    digitalWrite(TEENSY_POWER_PIN, LOW);
                    teensyPowerState = false;
                }
            }
        }
        valve1.update(servo1Angle);
        valve2.update(servo2Angle);
        // --- Ignition State Machine --- (runs independently of masterStateHigh)
        switch (ignitionStateMachine)
        {
        case IgnitionState::IGNITION_ON:
            if (millis() - ignitionStartTime >= ignitionOnDelay)
            {
                valve1.open(servo1Angle);
                valve2.open(servo2Angle);
                ignitionStateMachine = IgnitionState::VALVES_OPENING;
            }
            break;
        case IgnitionState::VALVES_OPENING:
            // Wait until both valves finish moving
            if (!valve1.isMoving() && !valve2.isMoving())
            {
                ignitionStateMachine = IgnitionState::WAITING;
                ignitionStartTime = millis();
            }
            break;
        case IgnitionState::WAITING:
            if (millis() - ignitionStartTime >= ignitionWaitingDelay)
            {
                ignitionStateMachine = IgnitionState::VALVES_CLOSING;
            }
            break;
        case IgnitionState::VALVES_CLOSING:
            valve1.close();
            valve2.close();
            ignitionStateMachine = IgnitionState::COMPLETE;
            break;
        case IgnitionState::COMPLETE:
            outputState2 = false;
            digitalWrite(IGNITION_PIN, LOW);
            ignitionStateMachine = IgnitionState::IDLE;
            break;
        case IgnitionState::IDLE:
        default:
            break;
        }

        vTaskDelay(xDelay);
    }
}

void WiFiServerTask(void *pvParameters)
{
    const TickType_t xDelay = pdMS_TO_TICKS(100); // 100ms delay
    bool wifiActive = false;

    // Initially turn off WiFi
    WiFi.mode(WIFI_OFF);

    for (;;)
    {
        // Check if halt state has changed
        // if (ConfigMode && !wifiActive)
        if (ConfigMode && !wifiActive)
        {
            // Activate WiFi only when halt state becomes HIGH
            WiFi.mode(WIFI_AP);
            WiFi.softAP(ssid, password);

            Serial.print("HALT detected: Access Point started: ");
            Serial.println(ssid);
            Serial.print("IP address: ");
            Serial.println(WiFi.softAPIP());

            dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());

            // Setup server routes
            server.on("/", handleRoot);       // Root page
            server.on("/config", handleRoot); // Config page
            server.on("/save", HTTP_POST, handleSave);
            server.onNotFound(handleRoot); // Catch all other requests

            // Start server
            server.begin();
            Serial.println("HTTP server started");

            // Buzz to indicate WiFi is now active
            // Buzz(1, 500, 0);

            wifiActive = true;
        }
        else if (!ConfigMode && wifiActive)
        {
            // Deactivate WiFi when halt state becomes LOW
            server.close();
            dnsServer.stop();
            WiFi.disconnect(true);
            WiFi.mode(WIFI_OFF);

            Serial.println("HALT deactivated: WiFi Access Point stopped");

            wifiActive = false;
        }

        // Only handle client requests when WiFi is active
        if (wifiActive)
        {
            dnsServer.processNextRequest();
            server.handleClient();
        }

        vTaskDelay(xDelay);
    }
}

void ValveI2CTask(void *pvParameters)
{
    const TickType_t xDelay = pdMS_TO_TICKS(100); // 100ms delay

    for (;;)
    {

        if (masterStateHigh && ignitionStateMachine == IgnitionState::IDLE)
        {
            // HOLDING SWITCH LOGIC: Act while switch is held HIGH
            if (Servo1State == HIGH)
            {
                if (!valve1.isOpen())
                {
                    valve1.open(servo1Angle);
                }
            }
            else
            {
                if (valve1.isOpen())
                {
                    valve1.close();
                }
            }

            if (Servo2State == HIGH)
            {
                if (!valve2.isOpen())
                {
                    valve2.open(servo2Angle);
                }
            }
            else
            {
                if (valve2.isOpen())
                {
                    valve2.close();
                }
            }

            if (haltState && ignitionStateMachine != IgnitionState::IDLE)
            {
                ignitionStateMachine = IgnitionState::IDLE;
                outputState2 = false;
                digitalWrite(IGNITION_PIN, LOW);
                valve1.close();
                valve2.close();
            }
        }

        // --- I2C Data Packet ---
        uint16_t freqInt = static_cast<uint16_t>(loraFreq * 10); // Convert to integer first
        uint8_t dataPacket[15] = {                               // Increased size from 7 to 15
                                  static_cast<uint8_t>(valve1.isOpen()),
                                  static_cast<uint8_t>(valve2.isOpen()),
                                  static_cast<uint8_t>(outputState1),
                                  static_cast<uint8_t>(outputState2),
                                  static_cast<uint8_t>(masterStateHigh),
                                  static_cast<uint8_t>(TestMode),
                                  static_cast<uint8_t>(parsuitedeploy),
                                  // LoRa configuration (8 bytes)
                                  static_cast<uint8_t>(freqInt & 0xFF),               // Frequency low byte (x10 for precision)
                                  static_cast<uint8_t>((freqInt >> 8) & 0xFF),        // Frequency high byte
                                  static_cast<uint8_t>(loraBandwidth & 0xFF),         // Bandwidth byte 1
                                  static_cast<uint8_t>((loraBandwidth >> 8) & 0xFF),  // Bandwidth byte 2
                                  static_cast<uint8_t>((loraBandwidth >> 16) & 0xFF), // Bandwidth byte 3
                                  static_cast<uint8_t>((loraBandwidth >> 24) & 0xFF), // Bandwidth byte 4
                                  loraCodingRate,
                                  loraSpreadingFactor};

        // serial print the data packet
        Serial.print("Data Packet: ");
        for (int i = 0; i < 15; i++)
        {
            Serial.println(dataPacket[i]);
        }

        Wire.beginTransmission(TEENSY_I2C_ADDRESS);
        Wire.write(dataPacket, 15);
        Wire.endTransmission();
        // size_t bytesWritten = Wire.write(dataPacket, 15); // Write the data packet
        // int result = Wire.endTransmission();
        // // Add error checking
        // if (result != 0)
        // {
        //     Serial.print("I2C transmission failed, error code: ");
        //     Serial.println(result);
        // }
        // else if (bytesWritten != 15)
        // {
        //     Serial.print("Expected to write 7 bytes, actually wrote: ");
        //     Serial.println(bytesWritten);
        // }

        vTaskDelay(xDelay);
    }
}